/* errAuthorizationInvalidSet */
"-60001" = "인증 권리가 유효하지 않습니다.";

/* errAuthorizationInvalidRef */
"-60002" = "인증 참고가 유효하지 않습니다.";

/* errAuthorizationInvalidTag */
"-60003" = "인증 태그가 유효하지 않습니다.";

/* errAuthorizationInvalidPointer */
"-60004" = "리턴된 인증이 유효하지 않습니다.";

/* errAuthorizationDenied */
"-60005" = "인증이 거부되었습니다.";

/* errAuthorizationCanceled */
"-60006" = "사용자에 의해 인증이 취소되었습니다.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "사용자 대화가 불가능하므로 인증이 거부되었습니다.";

/* errAuthorizationInternal */
"-60008" = "이 작업에 대한 인증을 얻을 수 없습니다.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "인증은 외부 형식으로 변환하는 것이 허락되지 않습니다.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "인증은 외부 형식으로 생성되는 것이 허락되지 않습니다.";

/* errAuthorizationInvalidFlags */
"-60011" = "제공된 옵션 플래그는 이 인증 작업에 대해 유효하지 않습니다.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "지정된 프로그램을 실행할 수 없습니다.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "권한이 주어진 도구의 실행 중 유효하지 않은 상태가 리턴되었습니다.";

/* errAuthorizationBadAddress */
"-60033" = "요청한 소켓 주소가 유효하지 않습니다(반드시 0-1023을 포함해야함).";

/* errSSLProtocol */
"-9800" = "SSL 프로토콜 오류";

/* errSSLNegotiation */
"-9801" = "Cipher Suite 처리 실패";

/* errSSLFatalAlert */
"-9802" = "치명적 오류 경고";

/* errSSLWouldBlock */
"-9803" = "I/O가 차단됨(치명적이지 않음)";

/* errSSLSessionNotFound */
"-9804" = "알 수 없는 세션을 복원하도록 시도";

/* errSSLClosedGraceful */
"-9805" = "연결이 올바르게 해제됨";

/* errSSLClosedAbort */
"-9806" = "오류로 연결이 해제됨";

/* errSSLXCertChainInvalid */
"-9807" = "유효하지 않은 인증 체인";

/* errSSLBadCert */
"-9808" = "올바르지 않은 인증 포맷";

/* errSSLCrypto */
"-9809" = "기본 암호 오류";

/* errSSLInternal */
"-9810" = "내부 오류";

/* errSSLModuleAttach */
"-9811" = "모듈 연결 실패";

/* errSSLUnknownRootCert */
"-9812" = "올바른 인증 체인, 신뢰할 수 없는 루트";

/* errSSLNoRootCert */
"-9813" = "루트에 의해 확인되지 않은 인증 체인";

/* errSSLCertExpired */
"-9814" = "만료된 인증서를 가진 체인";

/* errSSLCertNotYetValid */
"-9815" = "아직 허가하지 않은 인증서를 가진 체인";

/* errSSLClosedNoNotify */
"-9816" = "서버가 공지없이 세션을 종료했습니다.";

/* errSSLBufferOverflow */
"-9817" = "제공된 버퍼가 부족함";

/* errSSLBadCipherSuite */
"-9818" = "올바르지 않은 SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "예상치 못한 메시지 수신";

/* errSSLPeerBadRecordMac */
"-9820" = "올바르지 못한 MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "암호 해제 실패";

/* errSSLPeerRecordOverflow */
"-9822" = "기록 초과";

/* errSSLPeerDecompressFail */
"-9823" = "압축 해제 실패";

/* errSSLPeerHandshakeFail */
"-9824" = "핸드쉐이크 실패";

/* errSSLPeerBadCert */
"-9825" = "잘못된 다중 인증서";

/* errSSLPeerUnsupportedCert */
"-9826" = "지원되지 않는 잘못된 인증 포맷";

/* errSSLPeerCertRevoked */
"-9827" = "인증서 파기됨";

/* errSSLPeerCertExpired */
"-9828" = "인증서 만료됨";

/* errSSLPeerCertUnknown */
"-9829" = "알 수 없는 인증서";

/* errSSLIllegalParam */
"-9830" = "잘못된 매개변수";

/* errSSLPeerUnknownCA */
"-9831" = "알 수 없는 인증 권한";

/* errSSLPeerAccessDenied */
"-9832" = "접근 거부됨";

/* errSSLPeerDecodeError */
"-9833" = "디코딩 오류";

/* errSSLPeerDecryptError */
"-9834" = "암호 해제 오류";

/* errSSLPeerExportRestriction */
"-9835" = "보내기 제한";

/* errSSLPeerProtocolVersion */
"-9836" = "올바르지 않은 프로토콜 버전";

/* errSSLPeerInsufficientSecurity */
"-9837" = "충분하지 않은 보안";

/* errSSLPeerInternalError */
"-9838" = "내부 오류";

/* errSSLPeerUserCancelled */
"-9839" = "사용자가 취소함";

/* errSSLPeerNoRenegotiation */
"-9840" = "재검토 허용되지 않음";

/* errSSLServerAuthCompleted */
"-9841" = "서버 인증은 유효하지만 확인이 비활성화되면 무시됨";

/* errSSLClientCertRequested */
"-9842" = "서버에서 클라이언트 인증을 요청함";

/* errSSLHostNameMismatch */
"-9843" = "동등 호스트 이름 일치하지 않음";

/* errSSLConnectionRefused */
"-9844" = "상대방이 응답하기 전에 연결을 해제했습니다.";

/* errSSLDecryptionFail */
"-9845" = "암호 해제 실패";

/* errSSLBadRecordMac */
"-9846" = "올바르지 못한 MAC";

/* errSSLRecordOverflow */
"-9847" = "기록 초과";

/* errSSLBadConfiguration */
"-9848" = "구성 오류";

/* errSecSuccess */
"0" = "오류가 없습니다.";

/* errSecUnimplemented */
"-4" = "기능 또는 작업이 구현되지 않았습니다.";

/* errSecParam */
"-50" = "통과된 하나 이상의 매개변수가 유효하지 않습니다.";

/* errSecAllocate */
"-108" = "메모리를 할당하는데 실패했습니다.";

/* errSecNotAvailable */
"-25291" = "키체인이 없습니다. 컴퓨터를 다시 시작해야 할 수도 있습니다.";

/* errSecReadOnly */
"-25292" = "이 키체인을 수정할 수 없습니다.";

/* errSecAuthFailed */
"-25293" = "입력한 사용자 ID 및 암호문구가 올바르지 않습니다.";

/* errSecNoSuchKeychain */
"-25294" = "지정된 키체인을 찾을 수 없습니다.";

/* errSecInvalidKeychain */
"-25295" = "지정된 키체인은 올바른 키체인 파일이 아닙니다.";

/* errSecDuplicateKeychain */
"-25296" = "같은 이름의 키체인이 이미 있습니다.";

/* errSecDuplicateCallback */
"-25297" = "지정된 콜백이 이미 설치되어 있습니다.";

/* errSecInvalidCallback */
"-25298" = "지정된 콜백 기능이 올바르지 않습니다.";

/* errSecDuplicateItem */
"-25299" = "지정된 항목이 키체인에 이미 존재합니다.";

/* errSecItemNotFound */
"-25300" = "지정된 항목을 키체인에서 찾을 수 없습니다.";

/* errSecBufferTooSmall */
"-25301" = "지정된 항목을 사용할 메모리가 부족합니다.";

/* errSecDataTooLarge */
"-25302" = "이 항목에는 매우 크거나 표시될 수 없는 포맷으로 되어 있는 정보를 가지고 있습니다.";

/* errSecNoSuchAttr */
"-25303" = "지정된 속성이 없습니다.";

/* errSecInvalidItemRef */
"-25304" = "지정된 항목이 더이상 유효하지 않습니다. 키체인에서 삭제되었을 수 있습니다.";

/* errSecInvalidSearchRef */
"-25305" = "기존의 키체인에서 찾을 수 없습니다.";

/* errSecNoSuchClass */
"-25306" = "지정된 항목은 올바른 키체인이 아닙니다.";

/* errSecNoDefaultKeychain */
"-25307" = "기본 키체인을 찾을 수 없습니다.";

/* errSecInteractionNotAllowed */
"-25308" = "사용자 대화가 허용되지 않습니다.";

/* errSecReadOnlyAttr */
"-25309" = "지정된 속성을 수정할 수 없습니다.";

/* errSecWrongSecVersion */
"-25310" = "키체인이 다른 버전의 시스템 소프트웨어에서 생성되어 열 수 없습니다.";

/* errSecKeySizeNotAllowed */
"-25311" = "이 항목은 너무 큰 크기의 키를 지정합니다.";

/* errSecNoStorageModule */
"-25312" = "필요한 구성(데이터 스토리지 모듈)을 로드할 수 없습니다. 컴퓨터를 재시동해야 할 수도 있습니다.";

/* errSecNoCertificateModule */
"-25313" = "필요한 구성(인증 모듈)을 로드할 수 없습니다. 컴퓨터를 재시동해야 할 수도 있습니다.";

/* errSecNoPolicyModule */
"-25314" = "필요한 구성(정책 모듈)을 로드할 수 없습니다. 컴퓨터를 재시동해야 할 수도 있습니다.";

/* errSecInteractionRequired */
"-25315" = "사용자 대화가 필요하지만, 현재 허용되지 않았습니다.";

/* errSecDataNotAvailable */
"-25316" = "이 항목의 내용을 가져올 수 없습니다.";

/* errSecDataNotModifiable */
"-25317" = "이 항목의 내용을 수정할 수 없습니다.";

/* errSecCreateChainFailed */
"-25318" = "이 인증서를 허가하는데 필요한 하나 이상의 인증서를 찾을 수 없습니다.";

/* errSecInvalidPrefsDomain */
"-25319" = "지정된 환경설정 도메인이 올바르지 않습니다.";

/* errSecACLNotSimple */
"-25240" = "지정된 접근 제어 목록이 표준(단순) 형식에 없습니다.";

/* errSecPolicyNotFound */
"-25241" = "지정된 정책을 찾을 수 없습니다.";

/* errSecInvalidTrustSetting */
"-25242" = "지정된 신뢰 설정이 잘못되었습니다.";

/* errSecNoAccessForItem */
"-25243" = "지정된 항목에 접근 제어가 없습니다.";

/* errSecInvalidOwnerEdit */
"-25244" = "이 항목의 소유자를 변경하는 잘못된 시도입니다.";

/* errSecTrustNotAvailable */
"-25245" = "신뢰된 결과가 없습니다.";

/* errSecUnsupportedFormat */
"-25256" = "가져오기/보내기 포맷이 지원되지 않습니다.";

/* errSecUnknownFormat */
"-25257" = "가져오기에 알 수 없는 포맷입니다.";

/* errSecKeyIsSensitive */
"-25258" = "중요한 자료는 보낼때 보호되어야 합니다.";

/* errSecMultiplePrivKeys */
"-25259" = "여러 개의 개인 키를 가져오는 시도를 하였습니다.";

/* errSecPassphraseRequired */
"-25260" = "가져오기/보내기에 암호문구가 필요합니다.";

/* errSecInvalidPasswordRef */
"-25261" = "암호 참조가 유효하지 않습니다.";

/* errSecInvalidTrustSettings */
"-25262" = "신뢰 설정 레코드가 손상되었습니다.";

/* errSecNoTrustSettings */
"-25263" = "신뢰 설정을 찾을 수 없습니다.";

/* errSecPkcs12VerifyFailure */
"-25264" = "PKCS12 가져오기 중 MAC 확인이 실패하였습니다.";

/* errSecDecode */
"-26275" = "제공된 데이터를 디코드할 수 없습니다.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP 버퍼의 벡터 오류 값.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP 암호화 컨텍스트 오류 값.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP 단계 암호화 API 오류 값.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* 공개 키를 사용하려는 시도를 완료할 수 없음 * 알고리즘 특정 매개변수 부족.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "코드 서명 일치 실패";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "키 StartDate/EndDate 유효하지 않음";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "키체인 동기화 오류 코드";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 패딩 확인: 롤백 공격이 감지됨";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "OpenParameters 변수가 CSSM_DL_DbCreate로 보내어졌거나, CSSM_DL_DbOpen이 NULL 또는 유효한 CSSM_APPLEDL_OPEN_PARAMETERS 구성에 포인터가 아닙니다.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "디스크가 꽉 찼기 때문에 작업이 실패함";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "디스크 용량이 초과되었기 때문에 작업을 실패했습니다";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "파일이 너무 커서 작업이 실패함";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "키체인 데이터베이스의 내부 정보(\"blob\")가 유효하지 않음";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "데이터베이스의 내부 정보(\"blob\")에 대한 내부 데이터 포맷 버전이 유효하지 않음";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "호스트 이름 일치하지 않음";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "위험한 플래그 true를 가진 이해할 수 없는 확장자";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "정책에 의해 기본 제한 확장자가 필요하지만 현재 없음";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "유효하지 않은 BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "유효하지 않은 기관 키 ID ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "유효하지 않은 제목 키 ID ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "정책에 대해 유효하지 않은 키 사용";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "정책에 대해 유효하지 않은 확장키 사용";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "유효하지 않은 제목/기관 키 ID 결합";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint 초과";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "자기 확인을 하지 않은 루트 인증에서 인증 그룹 종료됨";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL 만료됨/아직 유효하지 않음";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "적절한 CRL 찾을 수 없음";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "지정된 CRL 서버 다운됨";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "불법의 CRL 배포 지점 URL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "알 수 없는 중요한 인증/CRL 확장자";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "앵커 또는 루트에 대해 CRL 확인할 수 없음";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "신뢰되지 않는 루트에 대해 CRL 확인";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL 정책 확인 실패";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "IssuingDistributionPoint 확장자 위반";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "인증이 지정된 issuerAltName에서 발견되지 않음";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "지정된 issuerAltName에서 받은 잘못된 인증";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME 이메일 주소 일치하지 않음";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "적절한 S/MIME ExtendedKeyUsage가 발견되지 않음";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME KeyUsage 호환되지 않음";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, KeyUsage의 인증 !위험함으로 플래그됨";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, 비어있는 제목과 이메일 주소의 리프 * SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, 비어있는 제목의 리프, SubjectAltName * 심각하지 않음";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "적절한 SSL ExtendedKeyUsage 찾을 수 없음";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "분석할 수 없는 OCSP 응답";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "분석할 수 없는 OCSP 요청";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP 서비스 사용할 수 없음";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP 상태: 인식할 수 없는 인증";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "각 인증에 대한 해지 확인이 성공적이지 않음";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "일반 네트워크 오류";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "앵커 또는 루트에 대해 OCSP 응답 확인할 수 없음";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "신뢰할 수 없는 루트에 대해 OCSP 응답이 확인됨";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP 응답 서명 오류";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "OCSP 응답에 대한 서명자를 찾을 수 없음";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP 응답자 상태: 잘못된 요청";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP 응답자 상태: 내부 오류";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP 응답자 상태: 나중에 시도";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP 응답자 상태: 서명 필요";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP 응답자 상태: 인증되지 않음";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP 응답 nonce가 요청과 일치하지 않음";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "코드 서명에 대한 부적절한 인증 체인 길이";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "코드 서명에 대한 기본 제한 유실";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "코드 서명에 대한 잘못된 PathLengthConstraint";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "코드 서명에 대한 ExtendedKeyUsage 유실";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "개발 스타일 코드 서명 인증 감지됨";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "리소스 서명에 대한 부적절한 인증 체인 길이";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "리소스 서명에 대한 잘못된 확장키 사용";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "신뢰 설정: 거부";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "유효하지 않은 비어있는 SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "알 수 없는 중요한 인증서 약관 ID";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "인증 요청이 대기됨";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "인증 요청이 재전송됨";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "서버에 보고된 일반 오류";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "매개변수 오류가 서버에 보고됨";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "인증 오류가 서버에 보고됨";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "구현되지 않았음이 서버에 보고됨";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "사용 가능하지 않음이 서버에 보고됨";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "이미 존재함이 서버에 보고됨";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "서비스 오류가 서버에 보고됨";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "지정된 사용자에 대해 요청이 이미 지연 중";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "지정된 사용자에 대해 지연 중인 요청 없음";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR이 확인하는 것을 실패했습니다";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "보고된 서버가 일관성 검사에 실패했습니다";

/* errSecCSUnimplemented */
"-67072" = "구현되지 않은 코드 서명 기능";

/* errSecCSInvalidObjectRef */
"-67071" = "유효하지 않은 API 대상체 참조";

/* errSecCSInvalidFlags */
"-67070" = "유효하거나 적절하지 않은 지정된 API 플래그";

/* errSecCSObjectRequired */
"-67069" = "필요한 포인터 변수가 NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "디스크 상에 코드 대상체를 찾을 수 없음";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "해당 설정으로 방문객을 찾을 수 없음";

/* errSecCSInvalidAttributeValues */
"-67066" = "주어진 속성 값이 유효하지 않음";

/* errSecCSNoSuchCode */
"-67065" = "요청된 속성을 가진 방문객이 호스트에 없습니다";

/* errSecCSMultipleGuests */
"-67064" = "호스트가 속성 값을 가진 여러 방문객을 가짐";

/* errSecCSGuestInvalid */
"-67063" = "코드 ID가 무효화됨";

/* errSecCSUnsigned */
"-67062" = "코드 대상체가 서명되어 있지 않음";

/* errSecCSSignatureFailed */
"-67061" = "코드 또는 서명이 수정됨";

/* errSecCSSignatureNotVerifiable */
"-67060" = "서명을 읽을 수 없음, 예를 들어, 파일 시스템에서 root를 권한이 없는 사용자로 매핑하였기 때문";

/* errSecCSSignatureUnsupported */
"-67059" = "서명의 유형 또는 버전이 지원되지 않음";

/* errSecCSBadDictionaryFormat */
"-67058" = "필요한 plist 파일 또는 리소스가 잘못됨";

/* errSecCSResourcesNotSealed */
"-67057" = "리소스가 서명되어 포함되어 있지 않음";

/* errSecCSResourcesNotFound */
"-67056" = "코드에서 포함된 리소스를 찾을 수 없음";

/* errSecCSResourcesInvalid */
"-67055" = "정해진 리소스 디렉토리가 유효하지 않습니다";

/* errSecCSBadResource */
"-67054" = "정해진 리소스가 유실되었거나 유효하지 않습니다";

/* errSecCSResourceRulesInvalid */
"-67053" = "유효하지 않은 리소스 선택 규칙";

/* errSecCSReqInvalid */
"-67052" = "코드 요구사항이 유효하지 않거나 손상됨";

/* errSecCSReqUnsupported */
"-67051" = "코드 요구사항의 유형 또는 버전이 지원되지 않음";

/* errSecCSReqFailed */
"-67050" = "코드 요구사항을 만족시키는데 실패함";

/* errSecCSBadObjectFormat */
"-67049" = "대상체 파일 포맷이 유효하지 않거나 적절하지 않음";

/* errSecCSInternalError */
"-67048" = "코드 서명 하위 시스템에서 내부 오류";

/* errSecCSHostReject */
"-67047" = "코드가 호스트를 거부함";

/* errSecCSNotAHost */
"-67046" = "이 코드는 호스트가 아닙니다";

/* errSecCSSignatureInvalid */
"-67045" = "서명에 대한 유효하지 않은 포맷";

/* errSecCSHostProtocolRelativePath */
"-67044" = "호스트 프로토콜 위반 - 독립된 방문객 경로가 필요함";

/* errSecCSHostProtocolContradiction */
"-67043" = "호스트 프로토콜 위반 - 모순되는 호스트 모드";

/* errSecCSHostProtocolDedicationError */
"-67042" = "호스트 프로토콜 위반 - 전용 방문객에 대한 작업이 허용되지 않음";

/* errSecCSHostProtocolNotProxy */
"-67041" = "호스트 프로토콜 위반 - 프록시 호스트가 예약되지 않음";

/* errSecCSHostProtocolStateError */
"-67040" = "호스트 프로토콜 위반 - 유효하지 않은 방문객 상태 변경 요청";

/* errSecCSHostProtocolUnrelated */
"-67039" = "호스트 프로토콜 위반 - 제공된 방문객이 제공된 호스트의 방문객이 아닙니다";

/* errSecCSInvalidOperation */
"-67038" = "요청된 작업이 유효하지 않습니다";

/* errSecCSNotSupported */
"-67037" = "작업이 이 유형의 코드에 대해 지원되지 않음";

/* errSecCSCMSTooLarge */
"-67036" = "내장하기에 서명이 너무 큼";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "호스트 프로토콜 위반 - 유효하지 않은 방문객 해시";

/* errSecCSStaticCodeChanged */
"-67034" = "디스크의 프로그램이 실행 중인 것과 일치하지 않습니다";

/* errSecCSSigDBDenied */
"-67033" = "서명 데이터베이스에 대한 접근이 거부됨";

/* errSecCSSigDBAccess */
"-67032" = "서명 데이터베이스에 접근할 수 없음";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "호스트가 유효하지 않거나 일치하지 않는 방문객 속성을 리턴함";

/* errSecMisc_dskFulErr */
"-34" = "디스크가 꽉 찼습니다.";

/* errSecMisc_nsvErr */
"-35" = "디스크를 찾을 수 없습니다. 디스크가 추출되었을 수 있습니다.";

/* errSecMisc_bdNamErr */
"-37" = "잘못된 문자가 포함된 이름을 열도록 시도했습니다.";

/* errSecMisc_fnfErr */
"-43" = "파일을 찾을 수 없습니다.";

/* errSecMisc_wPrErr */
"-44" = "쓰기가 금지된 디스크입니다.";

/* errSecMisc_fLckdErr */
"-45" = "파일이 잠겨 있습니다.";

/* errSecMisc_vLckdErr */
"-46" = "볼륨이 잠겨 있습니다.";

/* errSecMisc_fBsyErr */
"-47" = "파일이 사용중입니다. 다른 응용 프로그램이 사용중일 수 있습니다.";

/* errSecMisc_dupFNErr */
"-48" = "같은 이름의 파일이 이미 있습니다.";

/* errSecMisc_opWrErr */
"-49" = "파일이 쓰기 허용으로 이미 열려 있습니다.";

/* errSecMisc_volOffLinErr */
"-53" = "볼륨을 더이상 사용할 수 없습니다. 볼룸이 추출되었을 수도 있습니다.";

/* errSecMisc_permErr */
"-54" = "파일을 열 수 없습니다. 다른 응용 프로그램이 사용중일 수 있습니다.";

/* errSecMisc_extFSErr */
"-58" = "이 볼륨은 호환되지 않습니다.";

/* errSecMisc_wrPermErr */
"-61" = "파일을 쓸 수가 없습니다. 충분하지 않은 접근 권한으로 열었을 수 있습니다.";

/* errSecMisc_offLinErr */
"-65" = "저장 장치를 더이상 사용할 수 없습니다. 장치가 추출되었을 수도 있습니다.";

/* errSecMisc_dirNFErr */
"-120" = "디렉토리를 찾을 수 없습니다.";

/* errSecMisc_volGoneErr */
"-124" = "서버 볼륨을 더이상 사용할 수 없습니다. 연결이 해제되었을 수도 있습니다.";

/* errSecMisc_userCanceledErr */
"-128" = "사용자가 작업을 취소하였습니다.";

/* errSecMisc_resNotFound */
"-192" = "필요한 리소스를 찾을 수 없습니다.";

/* errSecMisc_resFNotFound */
"-193" = "필요한 리소스가 없거나 손상되었습니다.";

/* errSecMisc_icNoURLErr */
"-673" = "지정된 주소(URL)가 알 수 없는 유형이거나 충분한 정보가 없습니다.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "지정된 URL을 여는 도움말 응용 프로그램을 찾을 수 없습니다.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "이 항목의 주소(URL)가 없거나 올바르지 않은 포맷입니다.";

/* errSecMisc_afpAccessDenied */
"-5000" = "이 항목의 접근이 거부되었습니다.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "인증에 실패했습니다. 항목이 키체인에 추가된 다음 이 서버에 대한 암호가 변경된것 같습니다.";
